<template>
  <div class="app-container">
    <div class="saishi_title">
      <span>赛项介绍</span>
    </div>
    <el-divider></el-divider>
    <div class="saishi_content">
      <h4>小学组——贪吃蛇游戏</h4>
      <p>赛项说明：“贪吃蛇游戏”比赛为贪吃蛇吃果子，每回合都将调用玩家上传的编程代码，做出决策控制贪吃蛇进行运动，寻找出现的果子，贪吃蛇移动方向由编程代码控制。
        此赛项游戏主界面为30*30的网格，贪吃蛇从网格的左上角出发，寻找随机出现的果子。当贪吃蛇吃掉一个果子后，网格中会接着再出现一个果子，贪吃蛇身体长度随之加2，依次循环。
        蛇头与果子位置重合则判定为吃掉果子，果子不会出现在蛇身体上，贪吃蛇可以穿墙，蛇头碰撞自己蛇的身体(即序列重复)判定为死亡。
        果子随机出现是有规则的，每次果子距离蛇头的位置都是定长的，即从蛇头到每个果子的曼哈顿距离（不穿越边界条件下）的总和相同。
      </p>
      <p>
        评分标准:每次比赛会出现规定个数的果子，吃完所有果子或蛇死亡，则比赛停止，全部任务完成的参赛选手以贪吃蛇所走步长进行排名，步长最短者获胜。
        注意：当贪吃蛇未完成吃果子任务就死亡时，则按照吃果子由多到少进行排名，吃果子多的排名靠前；相同果子数，所用步数越少，得分越高。
      </p>
      <h4>初高中组——贪吃蛇博弈算法对抗</h4>
      <p>
        赛项说明:贪吃蛇博弈算法对抗为双人（或两组）对战，每回合都将调用玩家上传的博弈编程代码，做出决策控制贪吃蛇进行运动。此赛项将python人工智能中的算法思想与传统的贪吃蛇游戏相结合，在提高学生兴趣的情况下完成对当下最流行的人工智能的基本思想的初步认知。
        参赛者在30*30的网格中通过事先编写好的程序操纵各自的贪吃蛇，参赛者只能控制蛇头的朝向(上、下、左、右)来控制蛇的下一步移动的方向。蛇的初始位置固定，并以恒定速度前进；蛇会自动长大，前10回合每回合长度增加1，从第11回合开始，每2回合长度增加1。
        可以参考阿尔法狗的思想，通过python人工智能的思想尽可能去从总体上去考虑，不仅仅需要进行前向预测来寻找空间最大的可能走法。还要尽可能去预测比赛对象的可能前进路径去做出相应的堵截。
        比赛中不仅可以直接去考虑到战胜对方，也可以去考虑怎么让自己尽可能的存活更长的时间，从侧面取得胜利。
      </p>
      <p>
        胜负评价:蛇头在网格外、障碍物、自己蛇的身体(即序列重复)、对方蛇的身体(即与对方序列有相同坐标)，或非法操作均判定为死亡。任何一条蛇死亡时，游戏结束。若蛇同时死亡，判定为平局，否则先死的一方输，另一方赢。
      </p>
      <p>核心算法答辩评分标准（共计40分）</p>
      <p>1.算法创新性      分数：16分
        创新性算法>对经典算法进行改进>编码实现经典算法>直接调用</p>
      <p>2.答辩表现        分数：12分
        评委根据竞赛队伍现场答辩的表现给出综合评分；
      </p>
      <p>3.代码能力        分数：12分
        评委从编码规范、代码结构、代码注释、代码复用、封装、抽象等方面进行评价。
      </p>
      <p>
        总得分为：循环赛得分与答辩评分两部分之和。积分相同者再加赛一次。
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'comptitionAwardItem'
}
</script>

<style scoped>
  .app-container {
    padding: 30px;
  }
  .saishi_title {
    height: 50px;
    width: 200px;
    /*background-color: #716b8b;*/
    border-left-style: solid;
    border-left-color: #a0b9ec;
    border-left-width: 7px;
  }
  .saishi_title span {
    display: block;
    height: 50px;
    width: 200px;
    text-align: center;
    line-height: 50px;
    color: #707070;
  }
  .saishi_content p {
    line-height: 50px;
    text-indent: 2em;
  }
</style>
